Repository: cindychen92/deskpet
Catalog: Localizable.xcstrings
Source language: en
Languages: zh_hans

# accessibility.resource.choose_image
source: Choose image
zh_hans: 选择图片

# accessibility.resource.not_selected
source: Not selected
zh_hans: 尚未选择

# accessibility.resource.selected
source: Selected
zh_hans: 已选择

# effect.sleep
source: Zzz
zh_hans: 呼呼

# error.firebase.missing_user
source: Firebase is not signed in, so pet resources cannot be uploaded right now.
zh_hans: Firebase 用户尚未登录，暂时无法上传宠物资源。

# error.firebase.not_configured
source: Firebase is not configured, so pet images cannot be uploaded.
zh_hans: Firebase 尚未配置，无法上传宠物图片。

# error.pet_list.incomplete
source: The pet resource list is incomplete. Using the default Simba pet.
zh_hans: 宠物资源列表不完整，已切回默认 Simba。

# error.pet_list.unavailable
source: The cloud pet list is temporarily unavailable. Using the default Simba pet.
zh_hans: 云端宠物列表暂时不可用，已切回默认 Simba。

# error.pet_metadata.invalid
source: The uploaded pet must belong to the current user and include every required image.
zh_hans: 上传的宠物必须属于当前用户，并包含全部必需图片。

# error.pet_name.control_character
source: The pet name cannot contain line breaks or other control characters.
zh_hans: 宠物名称不能包含换行符或其他控制字符。

# error.pet_name.empty
source: Enter a name for the pet.
zh_hans: 请输入宠物名称。

# error.pet.image_load
source: The pet images could not be loaded. A fallback image is being shown.
zh_hans: 宠物图片加载失败，已显示备用图。

# error.pet.incomplete
source: This pet's image set is incomplete.
zh_hans: 这个宠物的图片还不完整。

# error.pet.not_found
source: That pet could not be found.
zh_hans: 没有找到这个宠物。

# error.pet.selection_save
source: The selected pet could not be saved.
zh_hans: 宠物选择保存失败。

# error.pet.uploaded_selection_save
source: The pet was uploaded, but the current selection could not be saved.
zh_hans: 宠物已上传，但当前选择保存失败。

# error.resource.invalid_png
source: “%1$@” must be a readable PNG image.
zh_hans: “%1$@”必须是可读取的 PNG 图片。

# error.resource.missing_images
source: Images are still missing: %1$@
zh_hans: 仍缺少图片：%1$@

# error.resource.upload_failed
source: “%1$@” could not be uploaded: %2$@
zh_hans: “%1$@”上传失败：%2$@

# language.applied_immediately
source: Language changes are applied immediately.
zh_hans: 语言更改会立即生效。

# language.description
source: Choose the language DeskPet uses for menus, messages, and settings.
zh_hans: 选择桌宠用于菜单、消息和设置的语言。

# language.heading
source: Language
zh_hans: 语言

# language.label
source: App Language
zh_hans: 应用语言

# language.option.english
source: English
zh_hans: 英语

# language.option.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# language.option.system_default
source: System Default
zh_hans: 跟随系统

# menu.action.cuddle
source: Cuddle
zh_hans: 撒娇

# menu.action.eat
source: Eat
zh_hans: 吃饭

# menu.action.jump
source: Jump
zh_hans: 跳一跳

# menu.action.lie
source: Lie Down
zh_hans: 趴下

# menu.action.normal
source: Normal
zh_hans: 普通

# menu.action.shake
source: Shake
zh_hans: 摇头

# menu.action.sleep
source: Sleep
zh_hans: 睡觉

# menu.pet_settings
source: Pet Settings…
zh_hans: 宠物设置…

# menu.pet.incomplete
source: %1$@ (resources incomplete)
zh_hans: %1$@（资源不完整）

# menu.pet.select
source: Select Pet
zh_hans: 选择宠物

# menu.quit
source: Quit DeskPet
zh_hans: 退出桌宠

# menu.walk.pause
source: Pause Edge Walking
zh_hans: 暂停边缘走动

# menu.walk.resume
source: Resume Edge Walking
zh_hans: 继续边缘走动

# resource.image.cuddle
source: Cuddling
zh_hans: 撒娇

# resource.image.eat
source: Eating
zh_hans: 吃饭

# resource.image.idle
source: Idle
zh_hans: 平常的样子

# resource.image.lie
source: Lying down
zh_hans: 趴下

# resource.image.sleep
source: Sleeping
zh_hans: 睡觉

# resource.image.walk.1
source: Walking 1
zh_hans: 走路 1

# resource.image.walk.2
source: Walking 2
zh_hans: 走路 2

# resource.image.walk.3
source: Walking 3
zh_hans: 走路 3

# resource.image.walk.4
source: Walking 4
zh_hans: 走路 4

# settings.error.select_all_images
source: Select every required image first.
zh_hans: 请先选择全部必需图片。

# settings.file_picker.message
source: Choose the “%1$@” image
zh_hans: 选择“%1$@”图片

# settings.heading
source: Manage Pet Resources
zh_hans: 管理宠物资源

# settings.pet_name.label
source: Pet Name
zh_hans: 宠物名称

# settings.pet_name.placeholder
source: For example: Ginger, My Dog, or 🐶
zh_hans: 例如：Ginger、我的小狗、🐶

# settings.resource.choose
source: Choose…
zh_hans: 选择…

# settings.resource.not_selected
source: Not selected
zh_hans: 尚未选择

# settings.resource.replace
source: Replace…
zh_hans: 更换…

# settings.resources.progress
source: Required images (%1$@ of %2$@ selected)
zh_hans: 必需图片（已选择 %1$@/%2$@）

# settings.status.upload_complete
source: %1$@ was uploaded and is now the current pet.
zh_hans: %1$@ 上传完成，已切换为当前宠物。

# settings.status.uploading_pet
source: Uploading %1$@…
zh_hans: 正在上传 %1$@…

# settings.tab.language
source: Language
zh_hans: 语言

# settings.tab.resources
source: Pet Resources
zh_hans: 宠物资源

# settings.upload
source: Upload and Use
zh_hans: 上传并使用

# settings.upload.in_progress
source: Uploading…
zh_hans: 正在上传…

# settings.window.title
source: Pet Settings
zh_hans: 宠物设置

# speech.cuddle
source: Cuddle time!
zh_hans: 贴贴时间到。

# speech.eat
source: Time to eat!
zh_hans: 开饭啦！

# speech.jump
source: Liftoff!
zh_hans: 起飞！

# speech.lie.action
source: Lying down!
zh_hans: 我趴好啦。

# speech.lie.tap
source: I'll lie down.
zh_hans: 我趴好啦。

# speech.normal
source: I'm back!
zh_hans: 我回来了。

# speech.pet.switched
source: Switched to %1$@.
zh_hans: 已切换到 %1$@。

# speech.shake
source: I heard that!
zh_hans: 听到了！

# speech.sleep.action
source: Just a quick nap.
zh_hans: 先睡一小会儿。

# speech.sleep.tap
source: So sleepy.
zh_hans: 困困。

# speech.walk.pause
source: I'll stand here for a while.
zh_hans: 我先站会儿。

# speech.walk.resume
source: Back on patrol!
zh_hans: 继续巡逻。
